# 問題：Climbing Stairs（超頻出）
# 階段が n 段あります。
# 1回で 1段 or 2段 上ることができます。
# 問い
# 頂上にたどり着く 方法の総数 を返してください。
# ⸻
# 制約
# 	•	1 <= n <= 45
# 	•	時間計算量はできれば O(n)

def climb_stairs(n)
  return 1 if n == 1
  return 2 if n == 2
  a = 1
  b = 2
  (3..n).each do
    a, b = b, a + b
  end
  b
end

# n = 2
# p climb_stairs(n)
# → 2 (1+1, 2)
# 1
# 1+1, 2
n = 3
p climb_stairs(n)
# → 3 (1+1+1, 1+2, 2+1)
n = 4
p climb_stairs(n)
# 1+1+1+1, 1+1+2, 1+2+1, 2+1+1, 2+2
n = 5
p climb_stairs(n)
# → 8

# 1
# 1+1,                                         2
# 1+1+1,                       1+2,            2+1
# 1+1+1+1,            1+1+2,   1+2+1,          2+1+1,          2+2
# 1+1+1+1+1, 1+1+1+2, 1+1+2+1, 1+2+1+1, 1+2+2, 2+1+1+1, 2+1+2, 2+2+1

# 1,0
# 1,1
# 2,1
# 3,2
# 5,3
